{"pages":[{"text":"Este artículo es un resumen de [BIL2013] , capítulo 2, epígrafe III Cuadro de mando integral Concepto desarrollado en [KAP1992] , consiste en una serie de indicadores financieros y no financieros clasificados en cuatro bloques, cuyo objetivo es medir los resultados de la organización. Perspectiva financiera ¿Qué debemos dar a nuestros accionistas para lograr el éxito financiero? Objetivos: Búsqueda de valor para el accionista Medidas concretas: Crecimiento y diversificación de ingresos Reducción de costes Utilización de activos Rentabilidad de los recursos propios y de los activos Perspectiva del cliente ¿Qué debemos dar a nuestros clientes para satisfacer nuestros objetivos estratégicos? Objetivos: Búsqueda de valor para el cliente Satisfacción del cliente Posicionamiento del mercado Medidas concretas: Cuota de mercado Incremento de cliente Satisfacción de cliente Rentabilidad de clientes Perspectiva de procesos internos ¿En que procesos internos debemos ser excelentes para satisfacer a nuestros clientes y accionistas? Objetivos: Búsqueda de valor en los procesos Eficiencia Medidas concretas: Innovación y mejora de los procesos Tiempos de los procesos Calidad de los procesos Coste de los procesos Perspectiva de recursos humanos ¿Cómo podemos seguir mejorando y crear valor? Los valores de este bloque actúan como palanca para el resto de perspectivas. Objetivos: Búsqueda de valor en los profesionales de la empresa. Capital intelectual Medidas concretas: Productividad de los empleados Retención de empleados Clima laboral Capacidades de los empleados Mapa estratégico En [KAP2000] , Kaplan y Norton desarrollan el concepto de mapa estratégico como una analogía militar. Los mapas estratégicos permiten describir de forma clara los objetivos, iniciativas, medidas e interrelaciones de todas las piezas de la estrategia, es decir, procuran mostrar como se pueden convertir las iniciativas y recursos en objetivos tangibles. ¿Por que son necesarios? En la era industrial, la economía se basaba en activos tangibles, mientras que en la era de la información, las empresas deben crear y utilizar activos intangibles, que aunque sean una fuente indudable de ventaja competitiva, no existen herramientas para describirlos y mostrar como pueden crear valor. ¿Cómo se diseña un mapa estratégico? Visión y Estrategia Un mapa estratégico debe comenzar a diseñarse de arriba a abajo, empezando con el lugar de destino y describiendo los caminos que llevarán a tal punto. Perspectiva financiera Una vez establecido el objetivo general, el mapa continuará con la estrategia financiera para crear valor para el accionista. Las empresas usan dos palancas: crecimiento de ingresos y productividad. La estrategia de crecimiento tiene dos partes: incrementar los ingresos procedentes de nuevos recursos y la rentabilidad de la clientela actual. La estrategia de productividad tiene dos partes: una mejora de la estructura de costes y una utilización efectiva de los activos. Perspectiva de los clientes Define como la empresa se diferencia de la competencia en lo que se refiere a atraer, retener y profundizar las relaciones con los clientes. Perspectiva de procesos internos La perspectiva de procesos internos se desarrolla en cuatro fases: Aumenta la ventaja innovando con nuevos productos y penetrando en nuevos mercados. Aumenta el valor de la clientela profundizando las relaciones con ella. Consigue la excelencia operativa Establece buenas relaciones con stakeholders Perspectiva de aprendizaje y crecimiento Define las competencias básicas, la tecnología y la cultura corporativa necesaria para afianzar la estrategia de la empresa. Los mapas estratégicos ayudarán a la organización a contemplar su estrategia de un modo integrado y sistemático y ofrecen la posibilidad de comunicar la estrategia a toda la organización. La estrategia implica el movimiento de una organización desde su posición actual a una posición incierta del futuro. El mapa estratégico contribuye a señalar las causas y los efectos de un modo explícito. Referencias [BIL2013] Paloma Bilbao, et al (2013), Política de Empresa y Estrategia , 3ªEd., Editorial Universitas [KAP1992] Kaplan y Norton (1992), The Balanced Scoreboard: Measures that Drive Performance , Harvard Business Review , vol. 70, n. 1, pp. 71-79 [KAP2000] Kaplan y Norton (2000), Having Trouble with Your Strategy? Then Map It , Harvard Business Review , vol. 78, n. 5, pp. 167-176","tags":"estrategia","loc":"/cuadro-mando-integral-mapa-estrategico.html","title":"El cuadro de mando integral y el mapa estratégico"},{"text":"Este artículo es un resumen de [Bilbao] , capítulo 4, epígrafe V Un sector entra en la fase de madurez cuando deja de crecer a un ritmo expansivo y crece a un ritmo más lento. Se dan una serie de cambios en el ambiente competitivo: cambios en el diseño estratégico de las empresas, de la estructura organizacional e incluso en el liderazgo de las empresas. Cambios que se producen en la transición a la madurez La disminución del crecimiento significa más competencia por la participación en el mercado. Los compradores son cada vez más exigentes y se hacen más fuertes en la negociación de sus compras. La competencia suele cambiar hacia un enfásis mayor en el coste y servicio. Las empresas tienen un problema de saturación al añadir capacidad de producción. Es difícil conseguir nuevos productos y aplicaciones. Aumenta la competencia internacional. Disminuyen los beneficios del sector, tanto para las empresas productoras como para las distribuidoras. Estrategias en sectores maduros La primera consecuencia de la madurez de un sector son los cambios de las interrelaciones de las cinco fuerzas del modelo de Porter, que conducen a un replanteamiento de los tres tipos genéricos de estrategias: estrategia de costes, estrategia de diferenciación y estrategia de enfoque Estrategia de costes La fuente más importante de ventaja en costes en sectores maduros son: Economías de escala La estandarización, común en los sectores maduros, propicia la explotación de las economías de escala. Las empresas grandes con mayor cuota de mercado pueden mantener su ventaja competitiva. Insumos de bajo coste Los competidores más pequeños tienen acceso a inputs más baratos. Las empresas grandes tienen posiciones de costes mayores debido a la presión de los sindicatos. Bajos costes generales Existe una correlación muy fuerte entre las reducciones de gastos generales y la rentabilidad de las empresas en sectores maduros. Las estrategías más exitosas en este sentido son las siguientes: Cirugía en activos y costes Recorte selectivo de productos y mercados Aumento escalonado de la productividad Estrategia de diferenciación \"... la estandarización... reduce las posibilidades de diferenciación, pero no las elimina por completo.\" — Robert Grant La innovación como vía de diferenciación Según Abell (1993), redefinir los límites del mercado (añadir grupos de clientes y/o productos/servicios complementarios) ofrece oportunidades para formular nuevas estrategias. La evidencia empírica avala la teoría de que la innovación es rentable, incluso en sectores maduros. El proyecto PIMS concluyó las relaciones (ROI~Calidad) y (ROI~I+D) son más robustas en mercados maduros que en mercados en crecimiento. En muchos sectores maduros, los innovadores estratégicos son, frecuentemente, empresas recien llegadas. Estrategia de enfoque Uno de los últimos segmentos a los que acuden las empresas cuando su sector alcanza la madurez es la competencia en mercados internacionales. Estrategia y cambios en la estructura organizativa La transición a sectores maduros debe ir acompañada de ajustes estructurales para llevar a buen término la estrategia. Los principales cambios afectan a los sistemas de control y a la motivación del personal. Problemas de estructura en sectores maduros Disminución de las expectativas para el desempeño financiero Más disciplina de la organización Disminución de las expectativas del progreso Prestar mayor atención a la dimensión humana de la empresa Recentralización de centros de costes y beneficios La burocracia maquinal y la eficiencia La madurez esta caracterizada por entorno sencillo y pocos cambios, por lo que a este entorno se le asocia el modelo organizativo que [Mintzberg] llama burocracia maquinal Principales características: Jerarquía de autoridad establecida con exactitud Sistema de lineas verticales de comunicación que han de ser observadas División reglamentada del trabajo basada en la especialización Sistemas de reglas y principios que establezca los derechos y deberes de todos los miembros de la organización Sistema de formas de procedimiento exactamente definidas para la realización de las tareas Estructuras que funcionan como maquinas integradas y reguladas. Para [Mintzberg] , cuando hay un conjunto de tareas sencillas y repetitivas, la burocracia maquinal es la más eficiente, donde están presentes los cinco elementos : Un consejo de dirección o director en la cúspide . Una tecnoestructura encargada de: planificación estratégica formación dirección de operaciones diseño y análisis de sistemas Un staff de apoyo que preste: asesoramiento legal relaciones públicas gestión de nominas ... Unos mandos intermedios encargados de: subdirección de operaciones marketing organización de planta La base con: agentes de compras operadores de maquinaria ensambladores personald e ventas y distribución A pesar de la claridad y fácil comprensión, hoy se tiene que abandonar la burocracia maquinal por estos cinco factores que apunta Grantt (1998) Aumento de la turbulencia del entorno Mayor énfasis en la innovación Nuevas tecnologías de procesos Alienación y conflicto Ejemplo japonés Como respuestas a estos factores, las empresas han sufrido un ajuste sustancial, destacándose: Mayor descentralización en la toma de decisiones Mayor enfásis en las economías de escala Mayor énfasis en la cooperación lateral Amplio uso de los incentivos basados en beneficios Estrategias para los sectores en declive Cuando un sector maduro sufre continuadamente un descenso de la demanda junto a un exceso de capacidad habrá entrado en declive. Factores estructurales que determinan el sector en declive Condiciones de la demanda lalala Incertidumbre de la demanda lalala Barreras de salida lalala Alternativas estretégicas Según [Grant] , las posibles estrategias en sectores en declive, de acuerdo con la posición competitiva de la empresa y la estructura del sector son cuatro: Liderazgo, Nicho, Cosecha y Desinversión Liderazgo Consiguiendo el liderazgo en el final del ciclo de vida del sector, una empresa puede desplazar a sus competidores. Una vez alcanza esta posición, la empresa puede elegir, entre mantener el liderazgo o una cosecha controlada. En esta posición, a la empresa le resulta fácil elegir entre una estrategia de costes o de diferenciación. Algunas tácticas para alcanzar el liderazgo: Políticas agresivas de marketing Reducir las barreras de salida de los competidores Proporcionando información fiable sobre la situación del mercado Elevar el riesgo de permanecer en el mercado para otros competidores Nicho El objetivo es identificar un segmento del sector que pueda mantener una demanda estable. Cosecha Consiste en maximizar el cash-flow con los activos actuales. Es una estrategia complicada que conlleva bastantes riesgos. Algunas tácticas: Eliminar nuevas inversiones Disminuir el presupuesto de mantenimiento, publicidad y/o investigación Desinversión Desinvertir cuanto antes de un sector en declive ayuda a minimizar los costes de las barreras de salida. Referencias [Bilbao] Paloma Bilbao, et al (2013), Política de Empresa y Estrategia , 3ªEd., Editorial Universitas [Mintzberg] ( 1 , 2 ) Henry Mintzberg, (1983), Structure in Fives Designing Effective Organizations , Prentice Hall [Grant] Robert M. Grant (2008), Contemporary Strategy Analysis , Blackwell Publishers","tags":"estrategia","loc":"/estrategia-sectores-maduros.html","title":"La estrategia en sectores maduros"},{"text":"Este artículo es un resumen de [BILBAO-2013] , capítulo 6 Internet incide en los tres terminos de la ecuación: $$B_{\\uparrow}=I_{\\uparrow}-C_{\\downarrow}$$ Beneficio: Permite la búsqueda de nuevas formas de beneficio Ingresos: Internet como nuevo canal de crecimiento Costes: Internet reduce el proceso y abarata los costes Los motivos para vender por internet son, entre otros: Mantenerse a la altura de la competencia Mejora de la imagen Aceleración del proceo de negocio Captación de nueos clientes Mejorar la calidad del servicio Expansión geográfica del mercado Las TIC no implican directamente un rendimiento sobre la actividad, sino que suponen un soporte básico a partir del cual implantar aplicaciones que si tengan efectos. Obstáculos percibidos: Productos inadecuados La empresa no lo necesita Clientes no preparados Incertidumbre del marco legal Seguridad en los pagos Problemas logísticos En España falta mucho por avanzar en el uso de internet, siendo el potencial enorme. La infraestructura de las TIC en España es similar al europeo, pero el gasto $TIC/PIB$ es de los más bajos de Europa y muy inferior a Japón y EEUU. Internet y la estructura de la industria Según Porter, Internet ha creado nuevas industrias, pero su gran impacto ha sido la reconfiguración de las industrias existentes con altos costes de comunicación (enseñanza a distancia, venta por catálogo...) Observando distintas industrias se observa diversas tendencias; algunas positivas, otras negativas, desde el punto de vista de la empresa. Amenaza de la competencia actual [-] Diferencia entre competidores [-] Tendencia a competir en precios [+] Mayor alcance geográfico Amenaza de la competencia potencial [-] Menores barreras de entrada Amenaza de productos sustitutivos [+] Aumenta el tamaño del mercado [-] Mayor número de productos sustitutivos Amenaza del poder de negociación de los proveedores [-] El proveedor puede tener acceso al consumidor final Amenaza del poder de negociación de los compradores [+] Eliminar canales poderosos [-] Aumenta el poder de negociación de los compradores [-] Disminuyen los costes de cambio Cada sector evolucionará de forma distinta, si se analiza el impacto en las cinco fuerzas competitivas se verá que internet seguirá presionando muchos sectores. Internet y la ventaja competitiva Las ventajas en precios y costes pueden conseguirse, por eficacia operativa o posicionamiento estratégico Eficacia operativa Internet es la herramienta más poderosa para aumentar la eficacia operativa. Las empresas conseguirán ventaja competitiva si son capaces de alcanzar mayor eficacia operativa que sus competidores. El problema, es que la ventaja competitiva es efímera, debido a la convergencia de la competencia. Al ser internet una plataforma abierta, resulta dificil obtener ventajas competitivas sostenibles. Posicionamiento estrátegico Por posicionamiento estrátegico se entiende desarrollar actividades diferentes a la competencia o realizar las mismas de una forma distinta. Debido a las dificultades de la eficacia operativa, el posicionamiento estratégico se convierte en clave. Principios para establecer y mantener un posicionamiento estratégico, según Porter: Definir el objetivo en términos de ROI Definir una propuesta de valor distinta a la competencia La estrategia se debe plasmar en una cadena de valor única Las estrategias siempre implican decisión La estrategia tiene que definir cómo encajan todos los elementos de la empresa. La estrategia quiere decir continuidad Internet como complemento a la estrategia Para capitalizar el potencial de internet hay que dejar de tenerle miedo, internet está modificando elementos de la cadena de valor perno no la transformará totalmente. Hay complementariesdad entre actividades online y offline debido a que introducir aplicaciones de internet en una actividad puede aumentar las necesidades de actividades físicas en otros eslabones de la cadena de valor. Internet y la cadena de valor La ventaja principal de internet es su capacidad de ligar las distintas actividades y dotarlas de información en tiempo real. Aunque internet es importante en la cadena de valor, no es el único factor, otros convencionales siguen siendo importantes: personal, productos, activos fijos Conclusión Hay que adoptar internet por las grandes posibilidades que ofrece Internet se explica como una etapa más en la trayectoria de las TIC Las ventajas competitivas se deben medir con los mismos parámetros que en el resto de industrias Los fundamentos de la estrategia permances iguales. Referencias [BILBAO-2013] Paloma Bilbao, et al (2013), Política de Empresa y Estrategia , 3ªEd., Editorial Universitas if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) { var mathjaxscript = document.createElement('script'); mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#'; mathjaxscript.type = 'text/javascript'; mathjaxscript.src = 'https:' == document.location.protocol ? 'https://c328740.ssl.cf1.rackcdn.com/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML' : 'http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML'; mathjaxscript[(window.opera ? \"innerHTML\" : \"text\")] = \"MathJax.Hub.Config({\" + \" config: ['MMLorHTML.js'],\" + \" TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'AMS' } },\" + \" jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" + \" extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" + \" displayAlign: 'center',\" + \" displayIndent: '0em',\" + \" showMathMenu: true,\" + \" tex2jax: { \" + \" inlineMath: [ ['$','$'] ], \" + \" displayMath: [ ['$$','$$'] ],\" + \" processEscapes: true,\" + \" preview: 'TeX',\" + \" }, \" + \" 'HTML-CSS': { \" + \" styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'black ! important'} }\" + \" } \" + \"}); \"; (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript); }","tags":"estrategia","loc":"/estrategia-internet.html","title":"Estrategia e Internet"},{"text":"Este artículo es un resumen de [BILBAO-2013] epígrafe II, capítulo 14 Los fundamentos teóricos del gobierno corporativo son útiles para determinar si el origen de los problemas de eficiencia en la estrategia está o no en el sistema de gobierno de la empresa. Es esencial, por tanto, comprender el gobierno corporativo desde un enfoque multiteórico . Los distintos enfoques teóricos Perspectivas unitarias Perspectivas conciliadoras Perspectivas externas Enfoque shareholders Enfoque Stakeholders Perspectivas internas Enfoque de los directivos Enfoque empresarial El enfoque de los directivos Estudia los mecanismos de gobierno que sirven a los intereses de los altos directivos. Presupone que los intereses de los directivos son buenos para todos. El enfoque shareholders Estudia como los consejos de administración se convierten en instrumentos al servicio de los intereses de los accionistas. El enfoque empresarial Propone que la empresa se gobierne con el fin de identificar la creación de valor a lo largo de toda la cadena de valor de la empresa y de mejorar la forma distribuirlo entre los distintos stakeholders El enfoque stakeholders De acuerdo con este enfoque, el gobierno corporativo es el resultado de las interacciones entre los distintos stakeholders Comparación entre las distintas teorías Perspectivas unitarias La teoría más representativa de los enfoques unitarios es la teoría de la agencia , la cual, aplicada al gobierno corporativo, sugiere que los accionistas elijen a un equipo de altos directivos para que se encargue del día a día de la empresa. Existirá un problema de agencia cuando los incentivos de los accionistas y los de los directivos no estén alineados. Para resolverlo se ha de incurrir en costes de agencia , por ejemplo, remunerando a los directivos con acciones de la empresa u opciones sobre acciones. Los enfoques unitarios se centran en la relación biletaral entre principales y pasan por alto las interdependencias entre los distintos stakeholders . Perspectivas conciliadoras El mejor ejemplo es la teoría conductista . La idea clave de esta teoría es que los objetivos y las decisiones de la empresa son el resultado de la negociación política entreo los distintos stakeholders de la empresa. La teoría conductista centra su análisis en el juego político de los consejeros, el grado de compromiso de los consejeros en la resolución de conflictos entre distintos stakeholders , la creación de valor a través del conocimiento y en las interacciones entre los consejeros y los procesos de decisión del consejo de administración. Existe un debate intenso entre ambas perspectivas, cuyo origen es la lucha entre la teoría económica neoclásica reflejada en la filosofía shareholders y la teoría de la empresa de los stackeholders Filosofía shareholders kkk Filosofía stakeholders kkk Referencias [BILBAO-2013] Paloma Bilbao, et al (2013), Política de Empresa y Estrategia , 3ªEd., Editorial Universitas","tags":"uned","loc":"/fundamentos-teoricos-gobierno-corporativo.html","title":"Fundamentos teóricos del gobierno corporativo"},{"text":"El conocimiento de la empresa Conceptos previos: Dato Representación de un grupo de objetos y acontencimientos que suceden en el mundo real. Información La materia prima del conocimiento, es un medio necesario para obtener y construir conocimiento. Representa un conjunto de datos estructurados, contextualizados, categorizados, calculados, corregidos y condensados. Conocimiento Es un recurso intangible con un potencial para la construcción de una ventaja competitiva sostenible. Representa verdades y creencias, perspectivas y conceptos, juicios y expectativas, metodología y know how . Capital social o intelectual Esta formado por las relaciones interpersonales y por los recursos involucrados en estas relaciones. Por tanto, incluye un conjunto de recursos intangibles basados en el conocimiento. Dimensiones: Relacional El capital social es el conjunto de recursos ligados a las relaciones entre individuos de la empresa, y de estos con otros stakeholders Elementos esenciales: Lenguaje y experiencias Normas y sanciones Expectativas Obligaciones Estructural El capital social es todo el conocimiento que queda en la empresa (bases de datos, rutinas, estrategias o cultura organizativa) Humana Representa la acumulación de conocimiento individual de todos los recursos humanos de la empresa. La creación del conocimiento El conocimiento reside en los individuos y es creado por éstos. —Nonaka, 1994 De entre todas las aportaciones científicas que tratan de responder cómo y por qué se genera conocimiento en la empresa, la más utilizada es el modelo SECI [Nonaka1994] , cuyas cuatro fases son: Socialización Proceso de generar nuevo conocimiento tácito a través de las experiencias compartidas. Externalización Proceso que convierte el conocimiento tácito en explícito, de forma que pueda ser compartido. El diálogo es la herramienta clave. Combinación El conocimiento explícito es recolectado y procesado para formar un conocimiento explícito más complejo. Este proceso permite que el conocimiento sea diseminado por toda la empresa. Internalización El conocimiento explícito creado y compartido se convierte en conocimiento tácito por cada uno de los individuos. El modelo SECI considera que el movimiento entre los cuatro modos de creación de conocimiento forma una espiral, donde la relación entre los conocimientos tácito y explícito se amplifica y recorre todos los niveles ontológicos. La gestión del conocimiento La gestión del conocimiento es el conjunto de procesos que permiten utilizar el conocimiento como factor clave para añadir y generar valor. Puede ser contemplada como un ciclo de generación de conocimientos en relación con la estrategia de la empresa y con sus actividades. KPMG propone un modelo de gestión de conocimiento de forma cíclica en el que se incluyen siete procesos básicos: Creación Aplicación Explotación Participación Diseminación Integración Aprendizaje La gestión del conocimiento trata de reforzar y optimizar todos estos procesos. El modelo puede ayudar a identificar y solucionar problemas de conocimiento de la empresa. Bilbao, Escudero y Rodriguez, Política de Empresa y Estrategia , Capítulo 13: La visión del empresa basada en el conocimiento, 3ªEd 2013, Editorial Universitas [Nonaka1994] Nonaka, Ikujiro (1994) A Dynamic Theory of Organizational Knowledge Creation , Organization Science, vol 5, num 1, pp 14-37","tags":"uned","loc":"/dimesion-estrategica-conocimiento.html","title":"Dimensión estratégica del conocimiento"},{"text":"Activo financiero al coste amortizado 2004 \\begin{equation*} \\begin{array} {|l|l|c|l|r|} \\hline 175 & \\text{Resultado del ejercicio} & \\text{a} & \\text{Valores representativos a lp} & 175 \\\\ \\hline \\end{array} \\end{equation*} Para preparar el balance consolidado 175 Resultado del ejercicio a Valores representativos a lp 175 Para preparar la cta. PyG consolidada: 175 Beneficios en participaciones y valores representativos de deuda a Saldo de Pérdidas y Ganancias 175 2005 Para preparar el balance consolidado: 175 Reservas a Valores representativos de deuda a lp 91 a Resultados del ejercicio 84 Para preparar la cta. de PYG: 84 Saldo de Perdidas y Ganancias a Ingresos de valores representativos de deuda 84 if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) { var mathjaxscript = document.createElement('script'); mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#'; mathjaxscript.type = 'text/javascript'; mathjaxscript.src = 'https:' == document.location.protocol ? 'https://c328740.ssl.cf1.rackcdn.com/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML' : 'http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML'; mathjaxscript[(window.opera ? \"innerHTML\" : \"text\")] = \"MathJax.Hub.Config({\" + \" config: ['MMLorHTML.js'],\" + \" TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'AMS' } },\" + \" jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" + \" extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" + \" displayAlign: 'center',\" + \" displayIndent: '0em',\" + \" showMathMenu: true,\" + \" tex2jax: { \" + \" inlineMath: [ ['$','$'] ], \" + \" displayMath: [ ['$$','$$'] ],\" + \" processEscapes: true,\" + \" preview: 'TeX',\" + \" }, \" + \" 'HTML-CSS': { \" + \" styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'black ! important'} }\" + \" } \" + \"}); \"; (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript); }","tags":"contabilidad","loc":"/eliminacion-resultados.html","title":"Eliminación de resultados por operaciones internas"},{"text":"Introducción Clasificación de estrategias básicas: (Ansoff, 1977) Productos Tradicionales Productos Nuevos Mercados Tradicionales EXPANSIÓN Penetración en el mercado EXPANSIÓN Desarrollo de productos Mercados Nuevos EXPANSIÓN Desarrollo de mercados DIVERSIFICACIÓN Fundamentos de la Estrategia de Internacionalización ¿Porque y cómo se internacionaliza la empresa? Razones Razón general La adaptación a un entorno cada vez más global. Factores Pais Ciclo de vida del producto o de la industria Cuando en el país de origen empiezan a notarse las fases de madurez, las empresas pueden buscar mercados extranjeros que se encuentren en una fase anterior. Puede ser suficiente la existencia de una demanda fuerte en un país extranjero. Reducción de costes Sin entrar en cuestiones éticas, muchas veces, la internacionalización responde a la busqueda de condiciones favorables respecto a los distintos inputs. Tamaño mínimo eficiente Si hay economías de escala, es posible que la demanda local no sea suficiente para alcanzar un nivel aceptable de eficiencia, por lo que procura una estrategia de internacionalización en busca de aumentar la demanda. Ej: Heineken, Carlsberg y Guiness Búsqueda de recursos Condiciones legales Factores del Sector Nivel de globalización: Porter, distingue los sectores, según el grado de globalización , en dos extremos: Industrias multipaís La competencia en cada país es independiente del resto. Las empresas tendrán que adaptarse a las condiciones propias de cada mercado. La internacionalización es opcional Industrias globales El sector, a nivel internacional, está formado por una serie de subsectores nacionales. Las empresas compiten a nivel global. La internacionalización es inevitable Factores de la Empresa Exceso de recursos Reducción del riesgo global de la compañía Dependencia estratégica Opciones Porter, partiendo del modelo de la cadena de valor distingue entre: Actividades orientadas hacia abajo (Cliente) Actividades orientadas hacia arriba (Proveedor) La estrategia internacional de las empresas dependerá de dos decisiones: De configuración (localización de las actividades que componen la cadena de valor) y de nivel de coordinación entre dichas actividades. Coordinación Alta Multipais Coordinada Global Pura Baja Multipais Pura Global con adaptaciones Dispersión Concentración Configuración Estrategia Global La coordinación y la configuración tienden a ser máximas Las empresas tratan de competir en costes sin perseguir la adaptación al cliente. Estrategia Global con adaptaciones Las empresas sacrifican parte de la eficiencia basada en la estandarización para adaptarse a los distintos mercados. Estrategia Multipais Las filiales funcionan de forma semiautónoma Las empresas comparten algunan capacidades que poseen a nivel global Es la peor situación desde el punto de vista de la eficiencia Estrategia Multipais Coordinada Localizar las actividades hacia arriba para optimizar los costes Localizar las actividades hacia abajo más cerca de los clientes Esta estrategia implica unos costes muy elevados derivados de la alta coordinación y dispersión. La evolución de las industrias tiende a la globalización. Esto tiene una doble implicación. Las empresas tratarán de conseguir altos niveles de coordinación. Sin embargo, la concentración tiene límites, por lo que las empresas deberán concebir su estrategia internacional de un modo dinámico. Formas (Modelo de Uppsala) Tres opciones fundamentales: Operaciones comerciales (Importación / Exportación) Acuerdos contractuales (Joint-ventures, Alianzas, Licencias) Inversión Directa Exterior El modelo percibe la internacionalización como un proceso en el que la empresa incrementa gradualmente su compromiso internacional. El proceso evoluciona en función de dos variables: Desarrollo de conocimientos Cantidad de Recursos comprometidos Dos aspectos sobre el Modelo de Uppsala: Describe como el compromiso en un mercado se desarrolla siguiendo unas pautas: La entrada se realiza al principio a través de exportaciones irregulares La siguiente fase implica la utilización de agentes independientes Finalmente, mediante la IDE a través de filiales comerciales y/o productivas Explica la elección del país de destino Donde las distancias geográfica y psicologica (idioma, cultura, desarrollo...) sean menores Ghemawat describe cuatro tipos de distancia ( modelo CAGE ) Distancia C ultural: Idioma, Raza, Religión, Normas sociales... Distancia A dministrativa: Lazos coloniales, Asociaciones políticas, Hostilidad política... Distancia G eográfica: Lejanía, Frontera común, Acceso fluvial, Medios de transporte... Distancia E conómica: Dif en los ingresos de los clientes, dif en costes y calidad de inputs... Precisiones: Su aplicación está orientada para empresas pequeñas El modelo se ajusta mejor a empresas sin experiencia previa en la actividad internacional Empresas grandes y las que tienen mayor experiencia alterarán el patrón descrito por el modelo de Uppsala Estrategia de diversificación Diversificación relacionada Integración vertical Resultados de la estrategia de diversificación","tags":"estrategia","loc":"/estrategias-corportativas-crecimiento.html","title":"Estrategias corporativas de crecimiento: Internacionalización y Diversificación"},{"text":"Problema: Tenemos un archivo PDF y nos gustaría tenerlo impreso en formato booklet para facilitar la lectura, ahorrar papel, etc Solución: pdf2ps input.pdf -| psbook | psnup -Pa4 -pa4 -2 -d | ps2pdf - output.pdf Del comando anterior solo tenemos que modificar input.pdf por el archivo PDF que queremos procesar y nos creará el booklet en el mismo directorio con el nombre output.pdf. Ahora vamos por partes, PSUtils es un conjunto de utlidades para trabajar con archivos Postscript, de entre los cuales estamos utilizando es esta receta cuatro de ellas: pdf2ps psbook psnup ps2pdf","tags":"linux","loc":"/crear-booklets-linux.html","title":"Crear booklets de PDF en linux"},{"text":"Resulta que hace unos días decidí probar el terminal Guake y cada vez que lo uso me gusta más, sin embargo, siempre que pulsaba Ctrl + Alt + T , se abría la antigua terminal que gnome trae de serie. Para cambiar la configuración de gnome abrir una terminal y ejecutar el siguiente comando: gsettings set org.gnome.desktop.default-applications.terminal exec 'guake' Ahora siempre aparecerá guake cuando invoquemos la terminal, y recuerda para enconderla y volverla a llamar con F12","tags":"Linux","loc":"/cambiar-terminal-gnome.html","title":"Como cambiar la Terminal por defecto de gnome"},{"text":"Según el modelo CAPM , la beta representa el riesgo sistémico de un activo, es decir, aquel que no puede reducirse diversificando. Mide la sensibilidad de la rentabilidad de un activo con la rentabilidad del mercado. Por ejemplo, si una acción tuviera una beta de 2, significaria que la rentabilidad de dicha acción es \"de media\" el doble que la rentabilidad del mercado (tanto en sentido positivo como negativo). Gráficamente corresponde a la pendiente de la linea de regresión calculada entre las rentabilidades de dicha acción con las rentabilidades de un índice de referencia, por ejemplo, el IBEX35 o el S&P500 para una acción americana. La linea de regresión entre las rentabilidades ( Security characteriric line ) esta definida por: $$r_i = \\alpha_i + \\beta_i\\cdot r_m + \\epsilon_i$$ En python podemos estimar fácilmente una linea de regresión con el método linregress del paquete scipy.stats e ilustrarla en un bonito gráfico con matplolib. Por ejemplo, la beta calculada con datos diarios de AIG en 2011 fue de 1.61 import datetime as dt from pandas.io.data import DataReader import scipy.stats as stats import matplotlib.pyplot as plt # Descarga datos de ejemplo AIG = DataReader ( 'AIG' , 'yahoo' , start = dt . datetime ( 2011 , 1 , 1 ), end = dt . datetime ( 2011 , 12 , 31 )) SP500 = DataReader ( '&#94;GSPC' , 'yahoo' , start = dt . datetime ( 2011 , 1 , 1 ), end = dt . datetime ( 2011 , 12 , 31 )) # Calcula las rentabilidades diarias AIG [ 'ret' ] = AIG [ 'Adj Close' ] . pct_change () SP500 [ 'ret' ] = SP500 [ 'Adj Close' ] . pct_change () # Calcula los coeficientes de la regresión ( BETA , ALPHA , R , P , SE ) = stats . linregress ( SP500 . ret . dropna (), AIG . ret . dropna ()) # Informe de la regresión print 'Beta: %4.2f \\n R2: %4.2f ' % ( BETA , R ** 2 ) # Gráfico de regresión plt . scatter ( SP500 . ret , AIG . ret , alpha = 0.3 ) plt . plot ( SP500 . ret , ALPHA + BETA \\ * SP500 . ret , color = 'r' ) plt . axvline ( ls = ':' , color = '0.2' ) plt . axhline ( ls = ':' , color = '0.2' ) plt . title ( 'Rentabilidades diarias 2011' ) plt . xlabel ( 'SP500' ) plt . ylabel ( 'AIG' ) plt . show () if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) { var mathjaxscript = document.createElement('script'); mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#'; mathjaxscript.type = 'text/javascript'; mathjaxscript.src = 'https:' == document.location.protocol ? 'https://c328740.ssl.cf1.rackcdn.com/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML' : 'http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML'; mathjaxscript[(window.opera ? \"innerHTML\" : \"text\")] = \"MathJax.Hub.Config({\" + \" config: ['MMLorHTML.js'],\" + \" TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'AMS' } },\" + \" jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" + \" extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" + \" displayAlign: 'center',\" + \" displayIndent: '0em',\" + \" showMathMenu: true,\" + \" tex2jax: { \" + \" inlineMath: [ ['$','$'] ], \" + \" displayMath: [ ['$$','$$'] ],\" + \" processEscapes: true,\" + \" preview: 'TeX',\" + \" }, \" + \" 'HTML-CSS': { \" + \" styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'black ! important'} }\" + \" } \" + \"}); \"; (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript); }","tags":"Python","loc":"/calcular-beta-python.html","title":"Calcular la beta de una acción con python"},{"text":"Si tenemos una inversión repartida entre varios activos, es decir, diversificada, nos gustaría saber cuál es la asignación óptima de cada activo de forma que maximicemos la rentabilidad sin aumentar el riesgo. Sobre esta cuestión trata buena parte de la literatura financiera desde que en 1952 Markowitz publicó su famoso artículo \"Porfolio Selection\" donde desarrolla el modelo media-varianza. Si para simplificar, consideramos solo dos activos: A y B, la rentabilidad de nuestra cartera P será: $$ r_P = w_A\\cdot r_A + w_B\\cdot r_B $$ , donde $ r_i$ son los vectores de rentabilidades cada activo y $ w_i$ son las ponderaciones. Debe cumplirse que: $ w_A + w_B = 1 $ Podemos simular las rentabilidades de distintas carteras combinando asignaciones diferentes entre A y B y representar gráficamente la media y la desviación típica (volatilidad) de la rentabilidad de cada una de estas carteras para obtener la bala de Markowitz . Se observa que para cada nivel de riesgo hay dos carteras distintas y se espera que un inversor racional elija aquella cuya rentabilidad es superior, de aqui el concepto de cartera eficiente. La parte superior de la bala representa la frontera eficiente. Se puede generalizar para n activos y la conclusión es la misma. En otro articulo veremos como encontrar la cartera óptima, donde en algunos casos nos ayudaran los multiplicadores de Lagrange y en otros tendremos que apoyarnos en métodos de optimización heurística. Y el código Python... import numpy as np import matplotlib.pyplot as plt import pandas as pd from pandas.io.data import DataReader import datetime as dt # Descarga datos de ejemplo A = DataReader ( 'TRE.MC' , 'yahoo' , start = dt . datetime ( 2011 , 1 , 1 ), end = dt . datetime ( 2011 , 12 , 31 )) B = DataReader ( 'BME.MC' , 'yahoo' , start = dt . datetime ( 2011 , 1 , 1 ), end = dt . datetime ( 2011 , 12 , 31 )) # Calcula la rentabilidad diaria de cada activo A [ 'ret' ] = A [ 'Adj Close' ] . pct_change () B [ 'ret' ] = B [ 'Adj Close' ] . pct_change () # Simula las ponderaciones de 50 carteras W = np . zeros ([ 50 , 2 ]) W [:, 0 ] = np . linspace ( - 2 , 2 , 50 ) W [:, 1 ] = 1 - W [:, 0 ] W = pd . DataFrame ( W , columns = [ 'A' , 'B' ]) # Simula las rentabilidades de las distinas carteras # y calcula la media y desviación tiípica de cada # una de ellas. P = np . zeros ([ 50 , 2 ]) for n in range ( 50 ): pf = W . A [ n ] * A . ret . dropna () + W . B [ n ] * B . ret . dropna () P [ n ] = pf . mean (), pf . std () # Dibuja el gráfico plt . scatter ( P [:, 1 ], P [:, 0 ]) plt . xlabel ( 'volatilidad' ) plt . ylabel ( 'rentabilidad' ) plt . show () if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) { var mathjaxscript = document.createElement('script'); mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#'; mathjaxscript.type = 'text/javascript'; mathjaxscript.src = 'https:' == document.location.protocol ? 'https://c328740.ssl.cf1.rackcdn.com/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML' : 'http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML'; mathjaxscript[(window.opera ? \"innerHTML\" : \"text\")] = \"MathJax.Hub.Config({\" + \" config: ['MMLorHTML.js'],\" + \" TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'AMS' } },\" + \" jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" + \" extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" + \" displayAlign: 'center',\" + \" displayIndent: '0em',\" + \" showMathMenu: true,\" + \" tex2jax: { \" + \" inlineMath: [ ['$','$'] ], \" + \" displayMath: [ ['$$','$$'] ],\" + \" processEscapes: true,\" + \" preview: 'TeX',\" + \" }, \" + \" 'HTML-CSS': { \" + \" styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'black ! important'} }\" + \" } \" + \"}); \"; (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript); }","tags":"Python","loc":"/dibujar-frontera-eficiente.html","title":"Dibujar la frontera eficiente de dos activos"},{"text":"El drawdown es una medida estadística que refleja los descensos relativos del valor de una inversión posteriores a los máximos que ésta alcanza. Ayuda a evaluar el riesgo de una inversión, cartera de valores, estrategia de trading, etc... Es esta página se ofrece la definición matemática del drawdown ilustrándola en R. Lo que sigue es un resumen en castellano y el código en Python haciendo uso de Pandas. Sea $v$ una serie temporal de los valores de una inversión con observaciones en $t=0,1,2,3...T$, el drawdown $D_t$ de esta serie en el momento $t$ se define como: $$ D_t = \\dfrac{v_t - v_t&#94;{max}}{v_t&#94;{max}}$$ Siendo $v_t&#94;{max}$, el máximo alcanzado hasta t, es decir, $v_t&#94;{max} = \\max\\{v_s|s\\in[0,t]\\}$ import datetime as dt import matplotlib.pyplot as plt from pandas.io.data import DataReader # Descarga datos de ejemplo TRE = DataReader ( 'TRE.MC' , 'yahoo' , start = dt . datetime ( 2012 , 1 , 1 )) # Calcula el drawdown V = TRE . Close TRE [ 'drawdown' ] = ( V - V . cummax ()) / V . cummax () # Dibuja el gráfico TRE [[ 'Close' , 'drawdown' ]] . plot ( subplots = True , grid = True , legend = False ) plt . fill_between ( TRE . index , TRE . drawdown , color = 'green' ) plt . show () if (!document.getElementById('mathjaxscript_pelican_#%@#$@#')) { var mathjaxscript = document.createElement('script'); mathjaxscript.id = 'mathjaxscript_pelican_#%@#$@#'; mathjaxscript.type = 'text/javascript'; mathjaxscript.src = 'https:' == document.location.protocol ? 'https://c328740.ssl.cf1.rackcdn.com/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML' : 'http://cdn.mathjax.org/mathjax/latest/MathJax.js?config=TeX-AMS-MML_HTMLorMML'; mathjaxscript[(window.opera ? \"innerHTML\" : \"text\")] = \"MathJax.Hub.Config({\" + \" config: ['MMLorHTML.js'],\" + \" TeX: { extensions: ['AMSmath.js','AMSsymbols.js','noErrors.js','noUndefined.js'], equationNumbers: { autoNumber: 'AMS' } },\" + \" jax: ['input/TeX','input/MathML','output/HTML-CSS'],\" + \" extensions: ['tex2jax.js','mml2jax.js','MathMenu.js','MathZoom.js'],\" + \" displayAlign: 'center',\" + \" displayIndent: '0em',\" + \" showMathMenu: true,\" + \" tex2jax: { \" + \" inlineMath: [ ['$','$'] ], \" + \" displayMath: [ ['$$','$$'] ],\" + \" processEscapes: true,\" + \" preview: 'TeX',\" + \" }, \" + \" 'HTML-CSS': { \" + \" styles: { '.MathJax_Display, .MathJax .mo, .MathJax .mi, .MathJax .mn': {color: 'black ! important'} }\" + \" } \" + \"}); \"; (document.body || document.getElementsByTagName('head')[0]).appendChild(mathjaxscript); }","tags":"Python","loc":"/calcular-el-drawdown-con-python.html","title":"Calcular el Drawdown con Python"},{"text":"Una pequeña muestra de como en tan sólo cinco líneas de código podemos obtener un gráfico de una serie temporal financiera, en este caso del índice Ibex-35 desde el año 2000. Esta receta utiliza el método DataReader de la librería pandas para descargar datos financieros desde Yahoo Finance import datetime import matplotlib.pyplot as plt from pandas.io.data import DataReader ibex35 = DataReader ( '&#94;IBEX' , 'yahoo' , start = datetime . datetime ( 2000 , 1 , 1 )) ibex35 [ 'Adj Close' ] . plot ()","tags":"Python","loc":"/visualizar-series-financieras-en-python.html","title":"Visualizar series financieras en python"}]}